Rent-A-Car/auth-service/src/main/resources/user-request.xml

<?xml version="1.0"?>
<soap:Envelope
        xmlns:soap="http://www.w3.org/2003/05/soap-envelope/"
        soap:encodingStyle="http://www.w3.org/2003/05/soap-encoding"
        xmlns:us="http://group56.com/soap-package">

    <soap:Header/>
    <soap:Body>
        <us:getUserRequest>
            <us:name>Petar</us:name>
        </us:getUserRequest>
    </soap:Body>
</soap:Envelope>
